MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB610/mcu.h
extern volatile ODCCBITS ODCCbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile uint16_t ANSC __attribute__((__sfr__));
__extension__ typedef struct tagANSCBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSC4:1;
      uint16_t :8;
      uint16_t ANSC13:1;
      uint16_t ANSC14:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELC4:1;
      uint16_t :8;
      uint16_t ANSELC13:1;
      uint16_t ANSELC14:1;
    };
  };
} ANSCBITS;
extern volatile ANSCBITS ANSCbits __attribute__((__sfr__));

#define ANSELC ANSELC
extern volatile uint16_t ANSELC __attribute__((__sfr__));
__extension__ typedef struct tagANSELCBITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ANSC4:1;
      uint16_t :8;
      uint16_t ANSC13:1;
      uint16_t ANSC14:1;
    };
    struct {
      uint16_t :4;
      uint16_t ANSELC4:1;
      uint16_t :8;
      uint16_t ANSELC13:1;
      uint16_t ANSELC14:1;
    };
  };
} ANSELCBITS;
extern volatile ANSELCBITS ANSELCbits __attribute__((__sfr__));

#define IOCPC IOCPC
extern volatile uint16_t IOCPC __attribute__((__sfr__));
typedef struct tagIOCPCBITS {
  uint16_t :1;
  uint16_t IOCPC1:1;
  uint16_t IOCPC2:1;
  uint16_t IOCPC3:1;
  uint16_t IOCPC4:1;
  uint16_t :7;
  uint16_t IOCPC12:1;
  uint16_t IOCPC13:1;
  uint16_t IOCPC14:1;
  uint16_t IOCPC15:1;
} IOCPCBITS;
extern volatile IOCPCBITS IOCPCbits __attribute__((__sfr__));

#define IOCNC IOCNC
extern volatile uint16_t IOCNC __attribute__((__sfr__));
typedef struct tagIOCNCBITS {
  uint16_t :1;
  uint16_t IOCNC1:1;
  uint16_t IOCNC2:1;
  uint16_t IOCNC3:1;
  uint16_t IOCNC4:1;
  uint16_t :7;
  uint16_t IOCNC12:1;
  uint16_t IOCNC13:1;
  uint16_t IOCNC14:1;
  uint16_t IOCNC15:1;
} IOCNCBITS;
extern volatile IOCNCBITS IOCNCbits __attribute__((__sfr__));

#define IOCFC IOCFC
extern volatile uint16_t IOCFC __attribute__((__sfr__));
typedef struct tagIOCFCBITS {
  uint16_t :1;
  uint16_t IOCFC1:1;
  uint16_t IOCFC2:1;
  uint16_t IOCFC3:1;
  uint16_t IOCFC4:1;
  uint16_t :7;
  uint16_t IOCFC12:1;
  uint16_t IOCFC13:1;
  uint16_t IOCFC14:1;
  uint16_t IOCFC15:1;
} IOCFCBITS;
extern volatile IOCFCBITS IOCFCbits __attribute__((__sfr__));

#define CNPUC CNPUC
extern volatile uint16_t CNPUC __attribute__((__sfr__));
__extension__ typedef struct tagCNPUCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t IOCPC1:1;
      uint16_t IOCPC2:1;
      uint16_t IOCPC3:1;
      uint16_t IOCPC4:1;
      uint16_t :7;
      uint16_t IOCPC12:1;
      uint16_t IOCPC13:1;
      uint16_t IOCPC14:1;
      uint16_t IOCPC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t IOCPUC1:1;
      uint16_t IOCPUC2:1;
      uint16_t IOCPUC3:1;
      uint16_t IOCPUC4:1;
      uint16_t :7;
      uint16_t IOCPUC12:1;
      uint16_t IOCPUC13:1;
      uint16_t IOCPUC14:1;
      uint16_t IOCPUC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t CNPUC1:1;
      uint16_t CNPUC2:1;
      uint16_t CNPUC3:1;
      uint16_t CNPUC4:1;
      uint16_t :7;
      uint16_t CNPUC12:1;
      uint16_t CNPUC13:1;
      uint16_t CNPUC14:1;
      uint16_t CNPUC15:1;
    };
  };
} CNPUCBITS;
extern volatile CNPUCBITS CNPUCbits __attribute__((__sfr__));

#define IOCPUC IOCPUC
extern volatile uint16_t IOCPUC __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t IOCPC1:1;
      uint16_t IOCPC2:1;
      uint16_t IOCPC3:1;
      uint16_t IOCPC4:1;
      uint16_t :7;
      uint16_t IOCPC12:1;
      uint16_t IOCPC13:1;
      uint16_t IOCPC14:1;
      uint16_t IOCPC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t IOCPUC1:1;
      uint16_t IOCPUC2:1;
      uint16_t IOCPUC3:1;
      uint16_t IOCPUC4:1;
      uint16_t :7;
      uint16_t IOCPUC12:1;
      uint16_t IOCPUC13:1;
      uint16_t IOCPUC14:1;
      uint16_t IOCPUC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t CNPUC1:1;
      uint16_t CNPUC2:1;
      uint16_t CNPUC3:1;
      uint16_t CNPUC4:1;
      uint16_t :7;
      uint16_t CNPUC12:1;
      uint16_t CNPUC13:1;
      uint16_t CNPUC14:1;
      uint16_t CNPUC15:1;
    };
  };
} IOCPUCBITS;
extern volatile IOCPUCBITS IOCPUCbits __attribute__((__sfr__));

#define CNPDC CNPDC
extern volatile uint16_t CNPDC __attribute__((__sfr__));
__extension__ typedef struct tagCNPDCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t IOCPDC1:1;
      uint16_t IOCPDC2:1;
      uint16_t IOCPDC3:1;
      uint16_t IOCPDC4:1;
      uint16_t :7;
      uint16_t IOCPDC12:1;
      uint16_t IOCPDC13:1;
      uint16_t IOCPDC14:1;
      uint16_t IOCPDC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t CNPDC1:1;
      uint16_t CNPDC2:1;
      uint16_t CNPDC3:1;
      uint16_t CNPDC4:1;
      uint16_t :7;
      uint16_t CNPDC12:1;
      uint16_t CNPDC13:1;
      uint16_t CNPDC14:1;
      uint16_t CNPDC15:1;
    };
  };
} CNPDCBITS;
extern volatile CNPDCBITS CNPDCbits __attribute__((__sfr__));

#define IOCPDC IOCPDC
extern volatile uint16_t IOCPDC __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDCBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t IOCPDC1:1;
      uint16_t IOCPDC2:1;
      uint16_t IOCPDC3:1;
      uint16_t IOCPDC4:1;
      uint16_t :7;
      uint16_t IOCPDC12:1;
      uint16_t IOCPDC13:1;
      uint16_t IOCPDC14:1;
      uint16_t IOCPDC15:1;
    };
    struct {
      uint16_t :1;
      uint16_t CNPDC1:1;
      uint16_t CNPDC2:1;
      uint16_t CNPDC3:1;
      uint16_t CNPDC4:1;
      uint16_t :7;
      uint16_t CNPDC12:1;
      uint16_t CNPDC13:1;
      uint16_t CNPDC14:1;
      uint16_t CNPDC15:1;
    };
  };
} IOCPDCBITS;
extern volatile IOCPDCBITS IOCPDCbits __attribute__((__sfr__));

#define TRISD TRISD
extern volatile uint16_t TRISD __attribute__((__sfr__));
typedef struct tagTRISDBITS {
  uint16_t TRISD0:1;
  uint16_t TRISD1:1;
  uint16_t TRISD2:1;
  uint16_t TRISD3:1;
  uint16_t TRISD4:1;
  uint16_t TRISD5:1;
  uint16_t TRISD6:1;
  uint16_t TRISD7:1;
  uint16_t TRISD8:1;
  uint16_t TRISD9:1;
  uint16_t TRISD10:1;
  uint16_t TRISD11:1;
  uint16_t TRISD12:1;
  uint16_t TRISD13:1;
  uint16_t TRISD14:1;
  uint16_t TRISD15:1;
} TRISDBITS;
extern volatile TRISDBITS TRISDbits __attribute__((__sfr__));

#define PORTD PORTD
extern volatile uint16_t PORTD __attribute__((__sfr__));
typedef struct tagPORTDBITS {
  uint16_t RD0:1;
  uint16_t RD1:1;
  uint16_t RD2:1;
  uint16_t RD3:1;
  uint16_t RD4:1;
  uint16_t RD5:1;
  uint16_t RD6:1;
  uint16_t RD7:1;
  uint16_t RD8:1;
  uint16_t RD9:1;
  uint16_t RD10:1;
  uint16_t RD11:1;
  uint16_t RD12:1;
  uint16_t RD13:1;
  uint16_t RD14:1;
  uint16_t RD15:1;
} PORTDBITS;
extern volatile PORTDBITS PORTDbits __attribute__((__sfr__));

#define LATD LATD
extern volatile uint16_t LATD __attribute__((__sfr__));
typedef struct tagLATDBITS {
  uint16_t LATD0:1;
  uint16_t LATD1:1;
  uint16_t LATD2:1;
  uint16_t LATD3:1;
  uint16_t LATD4:1;
  uint16_t LATD5:1;
  uint16_t LATD6:1;
  uint16_t LATD7:1;
  uint16_t LATD8:1;
  uint16_t LATD9:1;
  uint16_t LATD10:1;
  uint16_t LATD11:1;
  uint16_t LATD12:1;
  uint16_t LATD13:1;
  uint16_t LATD14:1;
  uint16_t LATD15:1;
} LATDBITS;
extern volatile LATDBITS LATDbits __attribute__((__sfr__));

#define ODCD ODCD
extern volatile uint16_t ODCD __attribute__((__sfr__));
typedef struct tagODCDBITS {
  uint16_t ODCD0:1;
  uint16_t ODCD1:1;
  uint16_t ODCD2:1;
  uint16_t ODCD3:1;
  uint16_t ODCD4:1;
  uint16_t ODCD5:1;
  uint16_t ODCD6:1;
  uint16_t ODCD7:1;
  uint16_t ODCD8:1;
  uint16_t ODCD9:1;
  uint16_t ODCD10:1;
  uint16_t ODCD11:1;
  uint16_t ODCD12:1;
  uint16_t ODCD13:1;
  uint16_t ODCD14:1;
  uint16_t ODCD15:1;
} ODCDBITS;
