MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB610/mcu.h
#define _IOCPUC_IOCPUC2_POSITION                 0x00000002
#define _IOCPUC_IOCPUC2_MASK                     0x00000004
#define _IOCPUC_IOCPUC2_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC3_POSITION                 0x00000003
#define _IOCPUC_IOCPUC3_MASK                     0x00000008
#define _IOCPUC_IOCPUC3_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC4_POSITION                 0x00000004
#define _IOCPUC_IOCPUC4_MASK                     0x00000010
#define _IOCPUC_IOCPUC4_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC12_POSITION                0x0000000C
#define _IOCPUC_IOCPUC12_MASK                    0x00001000
#define _IOCPUC_IOCPUC12_LENGTH                  0x00000001

#define _IOCPUC_IOCPUC13_POSITION                0x0000000D
#define _IOCPUC_IOCPUC13_MASK                    0x00002000
#define _IOCPUC_IOCPUC13_LENGTH                  0x00000001

#define _IOCPUC_IOCPUC14_POSITION                0x0000000E
#define _IOCPUC_IOCPUC14_MASK                    0x00004000
#define _IOCPUC_IOCPUC14_LENGTH                  0x00000001

#define _IOCPUC_IOCPUC15_POSITION                0x0000000F
#define _IOCPUC_IOCPUC15_MASK                    0x00008000
#define _IOCPUC_IOCPUC15_LENGTH                  0x00000001

#define _IOCPUC_CNPUC1_POSITION                  0x00000001
#define _IOCPUC_CNPUC1_MASK                      0x00000002
#define _IOCPUC_CNPUC1_LENGTH                    0x00000001

#define _IOCPUC_CNPUC2_POSITION                  0x00000002
#define _IOCPUC_CNPUC2_MASK                      0x00000004
#define _IOCPUC_CNPUC2_LENGTH                    0x00000001

#define _IOCPUC_CNPUC3_POSITION                  0x00000003
#define _IOCPUC_CNPUC3_MASK                      0x00000008
#define _IOCPUC_CNPUC3_LENGTH                    0x00000001

#define _IOCPUC_CNPUC4_POSITION                  0x00000004
#define _IOCPUC_CNPUC4_MASK                      0x00000010
#define _IOCPUC_CNPUC4_LENGTH                    0x00000001

#define _IOCPUC_CNPUC12_POSITION                 0x0000000C
#define _IOCPUC_CNPUC12_MASK                     0x00001000
#define _IOCPUC_CNPUC12_LENGTH                   0x00000001

#define _IOCPUC_CNPUC13_POSITION                 0x0000000D
#define _IOCPUC_CNPUC13_MASK                     0x00002000
#define _IOCPUC_CNPUC13_LENGTH                   0x00000001

#define _IOCPUC_CNPUC14_POSITION                 0x0000000E
#define _IOCPUC_CNPUC14_MASK                     0x00004000
#define _IOCPUC_CNPUC14_LENGTH                   0x00000001

#define _IOCPUC_CNPUC15_POSITION                 0x0000000F
#define _IOCPUC_CNPUC15_MASK                     0x00008000
#define _IOCPUC_CNPUC15_LENGTH                   0x00000001

#define _CNPDC_IOCPDC1_POSITION                  0x00000001
#define _CNPDC_IOCPDC1_MASK                      0x00000002
#define _CNPDC_IOCPDC1_LENGTH                    0x00000001

#define _CNPDC_IOCPDC2_POSITION                  0x00000002
#define _CNPDC_IOCPDC2_MASK                      0x00000004
#define _CNPDC_IOCPDC2_LENGTH                    0x00000001

#define _CNPDC_IOCPDC3_POSITION                  0x00000003
#define _CNPDC_IOCPDC3_MASK                      0x00000008
#define _CNPDC_IOCPDC3_LENGTH                    0x00000001

#define _CNPDC_IOCPDC4_POSITION                  0x00000004
#define _CNPDC_IOCPDC4_MASK                      0x00000010
#define _CNPDC_IOCPDC4_LENGTH                    0x00000001

#define _CNPDC_IOCPDC12_POSITION                 0x0000000C
#define _CNPDC_IOCPDC12_MASK                     0x00001000
#define _CNPDC_IOCPDC12_LENGTH                   0x00000001

#define _CNPDC_IOCPDC13_POSITION                 0x0000000D
#define _CNPDC_IOCPDC13_MASK                     0x00002000
#define _CNPDC_IOCPDC13_LENGTH                   0x00000001

#define _CNPDC_IOCPDC14_POSITION                 0x0000000E
#define _CNPDC_IOCPDC14_MASK                     0x00004000
#define _CNPDC_IOCPDC14_LENGTH                   0x00000001

#define _CNPDC_IOCPDC15_POSITION                 0x0000000F
#define _CNPDC_IOCPDC15_MASK                     0x00008000
#define _CNPDC_IOCPDC15_LENGTH                   0x00000001

#define _CNPDC_CNPDC1_POSITION                   0x00000001
#define _CNPDC_CNPDC1_MASK                       0x00000002
#define _CNPDC_CNPDC1_LENGTH                     0x00000001

#define _CNPDC_CNPDC2_POSITION                   0x00000002
#define _CNPDC_CNPDC2_MASK                       0x00000004
#define _CNPDC_CNPDC2_LENGTH                     0x00000001

#define _CNPDC_CNPDC3_POSITION                   0x00000003
#define _CNPDC_CNPDC3_MASK                       0x00000008
#define _CNPDC_CNPDC3_LENGTH                     0x00000001

#define _CNPDC_CNPDC4_POSITION                   0x00000004
#define _CNPDC_CNPDC4_MASK                       0x00000010
#define _CNPDC_CNPDC4_LENGTH                     0x00000001

#define _CNPDC_CNPDC12_POSITION                  0x0000000C
#define _CNPDC_CNPDC12_MASK                      0x00001000
#define _CNPDC_CNPDC12_LENGTH                    0x00000001

#define _CNPDC_CNPDC13_POSITION                  0x0000000D
#define _CNPDC_CNPDC13_MASK                      0x00002000
#define _CNPDC_CNPDC13_LENGTH                    0x00000001

#define _CNPDC_CNPDC14_POSITION                  0x0000000E
#define _CNPDC_CNPDC14_MASK                      0x00004000
#define _CNPDC_CNPDC14_LENGTH                    0x00000001

#define _CNPDC_CNPDC15_POSITION                  0x0000000F
#define _CNPDC_CNPDC15_MASK                      0x00008000
#define _CNPDC_CNPDC15_LENGTH                    0x00000001

#define _IOCPDC_IOCPDC1_POSITION                 0x00000001
#define _IOCPDC_IOCPDC1_MASK                     0x00000002
#define _IOCPDC_IOCPDC1_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC2_POSITION                 0x00000002
#define _IOCPDC_IOCPDC2_MASK                     0x00000004
#define _IOCPDC_IOCPDC2_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC3_POSITION                 0x00000003
#define _IOCPDC_IOCPDC3_MASK                     0x00000008
#define _IOCPDC_IOCPDC3_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC4_POSITION                 0x00000004
#define _IOCPDC_IOCPDC4_MASK                     0x00000010
#define _IOCPDC_IOCPDC4_LENGTH                   0x00000001

