MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB610/mcu.h
#define _CNPUG_CNPUG3_POSITION                   0x00000003
#define _CNPUG_CNPUG3_MASK                       0x00000008
#define _CNPUG_CNPUG3_LENGTH                     0x00000001

#define _CNPUG_CNPUG6_POSITION                   0x00000006
#define _CNPUG_CNPUG6_MASK                       0x00000040
#define _CNPUG_CNPUG6_LENGTH                     0x00000001

#define _CNPUG_CNPUG7_POSITION                   0x00000007
#define _CNPUG_CNPUG7_MASK                       0x00000080
#define _CNPUG_CNPUG7_LENGTH                     0x00000001

#define _CNPUG_CNPUG8_POSITION                   0x00000008
#define _CNPUG_CNPUG8_MASK                       0x00000100
#define _CNPUG_CNPUG8_LENGTH                     0x00000001

#define _CNPUG_CNPUG9_POSITION                   0x00000009
#define _CNPUG_CNPUG9_MASK                       0x00000200
#define _CNPUG_CNPUG9_LENGTH                     0x00000001

#define _CNPUG_CNPUG12_POSITION                  0x0000000C
#define _CNPUG_CNPUG12_MASK                      0x00001000
#define _CNPUG_CNPUG12_LENGTH                    0x00000001

#define _CNPUG_CNPUG13_POSITION                  0x0000000D
#define _CNPUG_CNPUG13_MASK                      0x00002000
#define _CNPUG_CNPUG13_LENGTH                    0x00000001

#define _CNPUG_CNPUG14_POSITION                  0x0000000E
#define _CNPUG_CNPUG14_MASK                      0x00004000
#define _CNPUG_CNPUG14_LENGTH                    0x00000001

#define _CNPUG_CNPUG15_POSITION                  0x0000000F
#define _CNPUG_CNPUG15_MASK                      0x00008000
#define _CNPUG_CNPUG15_LENGTH                    0x00000001

#define _IOCPUG_IOCPG0_POSITION                  0x00000000
#define _IOCPUG_IOCPG0_MASK                      0x00000001
#define _IOCPUG_IOCPG0_LENGTH                    0x00000001

#define _IOCPUG_IOCPG1_POSITION                  0x00000001
#define _IOCPUG_IOCPG1_MASK                      0x00000002
#define _IOCPUG_IOCPG1_LENGTH                    0x00000001

#define _IOCPUG_IOCPG2_POSITION                  0x00000002
#define _IOCPUG_IOCPG2_MASK                      0x00000004
#define _IOCPUG_IOCPG2_LENGTH                    0x00000001

#define _IOCPUG_IOCPG3_POSITION                  0x00000003
#define _IOCPUG_IOCPG3_MASK                      0x00000008
#define _IOCPUG_IOCPG3_LENGTH                    0x00000001

#define _IOCPUG_IOCPG6_POSITION                  0x00000006
#define _IOCPUG_IOCPG6_MASK                      0x00000040
#define _IOCPUG_IOCPG6_LENGTH                    0x00000001

#define _IOCPUG_IOCPG7_POSITION                  0x00000007
#define _IOCPUG_IOCPG7_MASK                      0x00000080
#define _IOCPUG_IOCPG7_LENGTH                    0x00000001

#define _IOCPUG_IOCPG8_POSITION                  0x00000008
#define _IOCPUG_IOCPG8_MASK                      0x00000100
#define _IOCPUG_IOCPG8_LENGTH                    0x00000001

#define _IOCPUG_IOCPG9_POSITION                  0x00000009
#define _IOCPUG_IOCPG9_MASK                      0x00000200
#define _IOCPUG_IOCPG9_LENGTH                    0x00000001

#define _IOCPUG_IOCPG12_POSITION                 0x0000000C
#define _IOCPUG_IOCPG12_MASK                     0x00001000
#define _IOCPUG_IOCPG12_LENGTH                   0x00000001

#define _IOCPUG_IOCPG13_POSITION                 0x0000000D
#define _IOCPUG_IOCPG13_MASK                     0x00002000
#define _IOCPUG_IOCPG13_LENGTH                   0x00000001

#define _IOCPUG_IOCPG14_POSITION                 0x0000000E
#define _IOCPUG_IOCPG14_MASK                     0x00004000
#define _IOCPUG_IOCPG14_LENGTH                   0x00000001

#define _IOCPUG_IOCPG15_POSITION                 0x0000000F
#define _IOCPUG_IOCPG15_MASK                     0x00008000
#define _IOCPUG_IOCPG15_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG0_POSITION                 0x00000000
#define _IOCPUG_IOCPUG0_MASK                     0x00000001
#define _IOCPUG_IOCPUG0_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG1_POSITION                 0x00000001
#define _IOCPUG_IOCPUG1_MASK                     0x00000002
#define _IOCPUG_IOCPUG1_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG2_POSITION                 0x00000002
#define _IOCPUG_IOCPUG2_MASK                     0x00000004
#define _IOCPUG_IOCPUG2_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG3_POSITION                 0x00000003
#define _IOCPUG_IOCPUG3_MASK                     0x00000008
#define _IOCPUG_IOCPUG3_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG6_POSITION                 0x00000006
#define _IOCPUG_IOCPUG6_MASK                     0x00000040
#define _IOCPUG_IOCPUG6_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG7_POSITION                 0x00000007
#define _IOCPUG_IOCPUG7_MASK                     0x00000080
#define _IOCPUG_IOCPUG7_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG8_POSITION                 0x00000008
#define _IOCPUG_IOCPUG8_MASK                     0x00000100
#define _IOCPUG_IOCPUG8_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG9_POSITION                 0x00000009
#define _IOCPUG_IOCPUG9_MASK                     0x00000200
#define _IOCPUG_IOCPUG9_LENGTH                   0x00000001

#define _IOCPUG_IOCPUG12_POSITION                0x0000000C
#define _IOCPUG_IOCPUG12_MASK                    0x00001000
#define _IOCPUG_IOCPUG12_LENGTH                  0x00000001

#define _IOCPUG_IOCPUG13_POSITION                0x0000000D
#define _IOCPUG_IOCPUG13_MASK                    0x00002000
#define _IOCPUG_IOCPUG13_LENGTH                  0x00000001

#define _IOCPUG_IOCPUG14_POSITION                0x0000000E
#define _IOCPUG_IOCPUG14_MASK                    0x00004000
#define _IOCPUG_IOCPUG14_LENGTH                  0x00000001

#define _IOCPUG_IOCPUG15_POSITION                0x0000000F
#define _IOCPUG_IOCPUG15_MASK                    0x00008000
#define _IOCPUG_IOCPUG15_LENGTH                  0x00000001

#define _IOCPUG_CNPUG0_POSITION                  0x00000000
#define _IOCPUG_CNPUG0_MASK                      0x00000001
#define _IOCPUG_CNPUG0_LENGTH                    0x00000001

#define _IOCPUG_CNPUG1_POSITION                  0x00000001
#define _IOCPUG_CNPUG1_MASK                      0x00000002
#define _IOCPUG_CNPUG1_LENGTH                    0x00000001

#define _IOCPUG_CNPUG2_POSITION                  0x00000002
#define _IOCPUG_CNPUG2_MASK                      0x00000004
#define _IOCPUG_CNPUG2_LENGTH                    0x00000001

#define _IOCPUG_CNPUG3_POSITION                  0x00000003
#define _IOCPUG_CNPUG3_MASK                      0x00000008
#define _IOCPUG_CNPUG3_LENGTH                    0x00000001

#define _IOCPUG_CNPUG6_POSITION                  0x00000006
#define _IOCPUG_CNPUG6_MASK                      0x00000040
#define _IOCPUG_CNPUG6_LENGTH                    0x00000001

#define _IOCPUG_CNPUG7_POSITION                  0x00000007
#define _IOCPUG_CNPUG7_MASK                      0x00000080
#define _IOCPUG_CNPUG7_LENGTH                    0x00000001

#define _IOCPUG_CNPUG8_POSITION                  0x00000008
#define _IOCPUG_CNPUG8_MASK                      0x00000100
#define _IOCPUG_CNPUG8_LENGTH                    0x00000001

#define _IOCPUG_CNPUG9_POSITION                  0x00000009
#define _IOCPUG_CNPUG9_MASK                      0x00000200
#define _IOCPUG_CNPUG9_LENGTH                    0x00000001

